book-review/app/controllers/books_controller.rb

  def create
  	book = Book.new(book_params)
  	book.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Top Esports"], ["body", "Strong\r\n"], ["created_at", "2020-09-16 15:02:10.539476"], ["updated_at", "2020-09-16 15:02:10.539476"]]

  def update
    book = Book.find(params[:id])
    book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "fxcz2"], ["body", "ub74j4dsahahhwe8y4d5"], ["updated_at", "2020-10-01 08:07:13.333533"], ["id", 1]]